using System.Collections;

namespace Pizza
{
    public partial class MainPage : ContentPage
    {
        public static MainPage page;

        public MainPage()
        {
            InitializeComponent();
            page = this;
            PizzaCart pizza1 = new PizzaCart("Пицца Гавайская", "pizza", "Курица жареная, ананас, сыр моцарелла",
                "Курица жареная, ананас консервированный, орегано, сыр Моцарелла, соус белый",
                "232/11/12/20", 23, 45, 50, 504, 702, 900, "Сыр", "Ананас", "Курица", "Соус", 25, 23, 23, 23, Pizzas, pizzaPan);

            PizzaCart pizza2 = new PizzaCart("Пицца Маргарита", "pizza2", "Помидоры черри, огурец, сыр, оливки, холопеньо, салями",
                "Помидоры черри, огурец, сыр, оливки, холопеньо, салями",
                "232/11/12/20", 23, 45, 50, 504, 702, 900, "Сыр", "Салями", "Оливки", "Черри", 25, 23, 23, 23, Pizzas, pizzaPan);

            PizzaCart pizza3 = new PizzaCart("Пицца Деревенская", "pizza3", "Курица жареная, ананас, сыр моцарелла",
                "Курица жареная, ананас консервированный, орегано, сыр Моцарелла, соус белый",
                "232/11/12/20", 23, 45, 50, 504, 702, 900, "Сыр", "Ананас", "Курица", "Соус", 25, 23, 23, 23, Pizzas, pizzaPan);
            
            PizzaCart pizza4 = new PizzaCart("Пицца Гавайская", "pizza", "Курица жареная, ананас, сыр моцарелла",
                "Курица жареная, ананас консервированный, орегано, сыр Моцарелла, соус белый",
                "232/11/12/20", 23, 45, 50, 504, 702, 900, "Сыр", "Ананас", "Курица", "Соус", 25, 23, 23, 23, Pizzas, pizzaPan);

            PizzaCart pizza5 = new PizzaCart("Пицца Маргарита", "pizza2", "Помидоры черри, огурец, сыр, оливки, холопеньо, салями",
                "Помидоры черри, огурец, сыр, оливки, холопеньо, салями",
                "232/11/12/20", 23, 45, 50, 504, 702, 900, "Сыр", "Салями", "Оливки", "Черри", 25, 23, 23, 23, Pizzas, pizzaPan);

            PizzaCart pizza6 = new PizzaCart("Пицца Деревенская", "pizza3", "Курица жареная, ананас, сыр моцарелла",
                "Курица жареная, ананас консервированный, орегано, сыр Моцарелла, соус белый",
                "232/11/12/20", 23, 45, 50, 504, 702, 900, "Сыр", "Ананас", "Курица", "Соус", 25, 23, 23, 23, Pizzas, pizzaPan);
        }
    }
}
